// https://javarush.com/quests/lectures/questsyntaxpro.level01.lecture04
// Типы переменных. Types of variables

// Task 1
public class Solution {
    public static void main(String[] args) {
        // объявлены и проинициализированы две переменные a и b
        int a = 10, b = 20;
    }
}
/* Объяви переменные a, b типа int.
Сразу же в строке объявления присвой им разные значения.
Значениями могут быть любые целые числа. */



// Task 2
// Мой юный друг. My young friend
public class Solution {
    public static void main(String[] args) {
        System.out.println(3126-8);
    }
}
/* Сейчас 3126 год. Мой друг родился 8 лет назад.
Написать программу, выводящую на экран год рождения моего друга. */